app/views/users/show.html.slim

SELECT  1 AS one FROM `user_experiences` WHERE `user_experiences`.`user_id` = 1 LIMIT 1
---
          = @user.profile.about
    - if @user.experiences.exists?