app/controllers/talks_controller.rb

  def index
    @talks = Talk.all.published
---
SELECT `talks`.* FROM `talks` WHERE `talks`.`published` = 1