app/controllers/users_controller.rb

  def show
    @user = User.includes(:profile).find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1